{
  "recipes": [
    {
      "id": 1,
      "title": "Classic Spaghetti Carbonara",
      "ingredients": [
        "200g spaghetti",
        "100g pancetta",
        "2 large eggs",
        "50g Pecorino cheese",
        "Salt and black pepper",
        "Fresh parsley"
      ],
      "instructions": [
        "Boil the spaghetti until al dente.",
        "In a separate pan, fry pancetta until crispy.",
        "In a bowl, whisk eggs, grated Pecorino cheese, salt, and pepper.",
        "Combine cooked spaghetti with pancetta, then add egg mixture and toss.",
        "Garnish with chopped fresh parsley and additional cheese.",
        "Serve immediately."
      ]
    },
    {
      "id": 2,
      "title": "Homemade Margherita Pizza",
      "ingredients": [
        "Pizza dough",
        "1/2 cup tomato sauce",
        "1 1/2 cups shredded mozzarella cheese",
        "Fresh basil leaves",
        "Olive oil",
        "Salt and pepper"
      ],
      "instructions": [
        "Preheat the oven to the highest temperature.",
        "Roll out the pizza dough on a floured surface.",
        "Spread tomato sauce over the dough, leaving a border.",
        "Sprinkle shredded mozzarella over the sauce.",
        "Drizzle olive oil and season with salt and pepper.",
        "Bake in the preheated oven until the crust is golden and cheese is bubbly.",
        "Remove from the oven, top with fresh basil leaves, and let it cool slightly before slicing."
      ]
    },
    {
      "id": 3,
      "title": "Creamy Chicken Alfredo",
      "ingredients": [
        "2 boneless, skinless chicken breasts",
        "200g fettuccine pasta",
        "2 cups heavy cream",
        "1 cup grated Parmesan cheese",
        "4 cloves garlic, minced",
        "2 tablespoons butter",
        "Salt and black pepper",
        "Chopped parsley"
      ],
      "instructions": [
        "Season chicken breasts with salt and pepper.",
        "In a pan, melt butter and cook chicken until golden and cooked through.",
        "Remove chicken and sauté minced garlic until fragrant.",
        "Pour in heavy cream, then add grated Parmesan. Stir until sauce thickens.",
        "Cook fettuccine according to package instructions, then add to the sauce.",
        "Slice the cooked chicken and place on top of the pasta.",
        "Garnish with chopped parsley before serving."
      ]
    },
    {
      "id": 4,
      "title": "Fresh Garden Salad",
      "ingredients": [
        "Mixed salad greens",
        "Cherry tomatoes",
        "Cucumber",
        "Red onion",
        "Carrots",
        "Bell peppers",
        "Balsamic vinaigrette"
      ],
      "instructions": [
        "Wash and dry the salad greens.",
        "Slice cherry tomatoes in half.",
        "Peel and dice the cucumber, red onion, and carrots.",
        "Remove seeds and slice bell peppers.",
        "In a large bowl, combine all vegetables.",
        "Drizzle balsamic vinaigrette over the salad and toss.",
        "Serve immediately as a side or with your choice of protein."
      ]
    },
    {
      "id": 5,
      "title": "Beef Tacos with Salsa",
      "ingredients": [
        "1 pound ground beef",
        "1 packet taco seasoning",
        "Taco shells",
        "Shredded lettuce",
        "Diced tomatoes",
        "Shredded cheddar cheese",
        "Sour cream",
        "Salsa"
      ],
      "instructions": [
        "In a pan, cook ground beef until browned.",
        "Add taco seasoning and water as per packet instructions.",
        "Warm taco shells in the oven.",
        "Fill taco shells with cooked beef.",
        "Top with shredded lettuce, diced tomatoes, cheese, sour cream, and salsa.",
        "Serve immediately."
      ]
    },
    {
      "id": 6,
      "title": "Vegetable Stir-Fry",
      "ingredients": [
        "Assorted vegetables (bell peppers, broccoli, carrots, snow peas, etc.)",
        "Tofu or protein of your choice",
        "Soy sauce",
        "Sesame oil",
        "Minced garlic",
        "Ginger",
        "Cooking oil"
      ],
      "instructions": [
        "Prepare the vegetables by washing, peeling, and chopping.",
        "Cut tofu or protein into bite-sized pieces.",
        "Heat cooking oil in a wok or pan.",
        "Add minced garlic and ginger, then stir-fry tofu/protein until cooked.",
        "Add vegetables and stir-fry until tender-crisp.",
        "Drizzle with soy sauce and sesame oil while stirring.",
        "Serve over cooked rice or noodles."
      ]
    },
    {
      "id": 7,
      "title": "Blueberry Pancakes",
      "ingredients": [
        "1 cup all-purpose flour",
        "1 tablespoon sugar",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "Pinch of salt",
        "1 cup buttermilk",
        "1 egg",
        "2 tablespoons melted butter",
        "Fresh blueberries"
      ],
      "instructions": [
        "In a bowl, whisk together flour, sugar, baking powder, baking soda, and salt.",
        "In another bowl, whisk buttermilk, egg, and melted butter.",
        "Combine wet and dry ingredients until just mixed.",
        "Gently fold in fresh blueberries.",
        "Heat a non-stick pan over medium heat.",
        "Pour batter onto the pan to make pancakes.",
        "Cook until bubbles form on the surface, then flip and cook the other side.",
        "Serve with maple syrup and additional blueberries."
      ]
    },
    {
      "id": 8,
      "title": "Roast Beef with Rosemary Potatoes",
      "ingredients": [
        "2-pound beef roast",
        "4 large potatoes, cubed",
        "Rosemary sprigs",
        "Olive oil",
        "Salt and pepper",
        "Garlic cloves",
        "Beef broth"
      ],
      "instructions": [
        "Preheat the oven to a high temperature.",
        "Rub the beef roast with olive oil, salt, and pepper.",
        "Place the roast in a roasting pan, surrounded by rosemary sprigs and garlic cloves.",
        "In a separate bowl, toss cubed potatoes with olive oil, salt, and pepper.",
        "Spread the potatoes around the roast in the pan.",
        "Roast in the preheated oven until the beef is cooked to your desired level of doneness.",
        "Remove the roast and let it rest before slicing.",
        "Serve with the roasted rosemary potatoes."
      ]
    },
    {
      "id": 9,
      "title": "Creamy Tomato Basil Soup",
      "ingredients": [
        "2 cans whole tomatoes",
        "1 onion, chopped",
        "3 cloves garlic, minced",
        "2 cups vegetable broth",
        "1/2 cup heavy cream",
        "Fresh basil leaves",
        "Olive oil",
        "Salt and pepper"
      ],
      "instructions": [
        "In a pot, sauté chopped onion and minced garlic in olive oil.",
        "Add canned tomatoes and vegetable broth. Bring to a simmer.",
        "Use an immersion blender to puree the soup until smooth.",
        "Stir in heavy cream and torn basil leaves.",
        "Simmer for a few more minutes, then season with salt and pepper.",
        "Serve hot with crusty bread or a grilled cheese sandwich."
      ]
    },
    {
      "id": 10,
      "title": "Lemon Herb Grilled Chicken",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "2 lemons",
        "Fresh thyme",
        "Fresh rosemary",
        "Garlic cloves",
        "Olive oil",
        "Salt and pepper"
      ],
      "instructions": [
        "Zest and juice one lemon.",
        "In a bowl, combine lemon zest, lemon juice, chopped thyme, chopped rosemary, minced garlic, olive oil, salt, and pepper.",
        "Add chicken breasts to the marinade and let them marinate for at least 30 minutes.",
        "Preheat a grill or grill pan over medium-high heat.",
        "Grill the marinated chicken breasts until cooked through.",
        "Slice the remaining lemon and grill for a minute on each side.",
        "Serve the grilled chicken with grilled lemon slices."
      ]
    },
    {
      "id": 11,
      "title": "Chocolate Chip Cookies",
      "ingredients": [
        "1 cup butter, softened",
        "3/4 cup granulated sugar",
        "3/4 cup brown sugar",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "2 1/4 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "2 cups chocolate chips"
      ],
      "instructions": [
        "Preheat the oven to 375°F (190°C).",
        "In a large bowl, cream together butter, granulated sugar, and brown sugar until smooth.",
        "Beat in eggs one at a time, then stir in vanilla.",
        "In a separate bowl, combine flour, baking soda, and salt.",
        "Gradually add dry ingredients to the wet ingredients and mix well.",
        "Fold in chocolate chips.",
        "Drop rounded tablespoons of dough onto ungreased baking sheets.",
        "Bake for 9 to 11 minutes or until golden brown.",
        "Allow cookies to cool on baking sheets for a few minutes before transferring to wire racks to cool completely."
      ]
    },
    {
      "id": 12,
      "title": "Mushroom Risotto",
      "ingredients": [
        "1 1/2 cups Arborio rice",
        "4 cups chicken or vegetable broth",
        "1 cup dry white wine",
        "1 onion, finely chopped",
        "2 cups mushrooms, sliced",
        "1/2 cup grated Parmesan cheese",
        "2 tablespoons butter",
        "Olive oil",
        "Salt and black pepper",
        "Fresh parsley"
      ],
      "instructions": [
        "In a pot, heat the chicken or vegetable broth and keep it warm.",
        "In a large skillet, sauté chopped onion in olive oil until translucent.",
        "Add Arborio rice and cook for a few minutes until lightly toasted.",
        "Pour in white wine and cook until absorbed by the rice.",
        "Gradually add warm broth, one ladleful at a time, stirring constantly and allowing the liquid to be absorbed before adding more.",
        "In a separate pan, sauté sliced mushrooms in butter until tender.",
        "When the rice is creamy and cooked al dente, stir in cooked mushrooms and grated Parmesan.",
        "Season with salt and black pepper to taste.",
        "Garnish with chopped fresh parsley before serving."
      ]
    },
    {
      "id": 13,
      "title": "Pasta Primavera",
      "ingredients": [
        "8 ounces penne pasta",
        "Assorted vegetables (zucchini, bell peppers, cherry tomatoes, broccoli, etc.)",
        "2 cloves garlic, minced",
        "1/4 cup olive oil",
        "Grated Parmesan cheese",
        "Fresh basil leaves",
        "Salt and pepper"
      ],
      "instructions": [
        "Cook penne pasta according to package instructions.",
        "In a pan, sauté minced garlic in olive oil until fragrant.",
        "Add assorted vegetables and cook until tender-crisp.",
        "Toss cooked pasta and vegetables together in the pan.",
        "Season with salt and pepper.",
        "Serve with grated Parmesan cheese and torn basil leaves on top."
      ]
    },
    {
      "id": 14,
      "title": "Berry Spinach Salad",
      "ingredients": [
        "Baby spinach leaves",
        "Mixed berries (strawberries, blueberries, raspberries)",
        "Goat cheese",
        "Candied pecans",
        "Balsamic vinaigrette"
      ],
      "instructions": [
        "Wash and dry the baby spinach leaves.",
        "Slice strawberries and prepare other berries.",
        "Crumble goat cheese and chop candied pecans.",
        "In a large bowl, combine spinach, berries, goat cheese, and pecans.",
        "Drizzle balsamic vinaigrette over the salad and toss gently.",
        "Serve as a refreshing and colorful side dish."
      ]
    },
    {
      "id": 15,
      "title": "Honey Glazed Salmon",
      "ingredients": [
        "4 salmon fillets",
        "1/4 cup honey",
        "2 tablespoons soy sauce",
        "2 tablespoons Dijon mustard",
        "Minced garlic",
        "Lemon juice",
        "Salt and black pepper",
        "Fresh dill"
      ],
      "instructions": [
        "Preheat the oven to 400°F (200°C).",
        "In a bowl, whisk together honey, soy sauce, Dijon mustard, minced garlic, and lemon juice.",
        "Place salmon fillets on a baking sheet lined with parchment paper.",
        "Brush the honey glaze over the salmon fillets.",
        "Season with salt and black pepper.",
        "Bake in the preheated oven for about 12-15 minutes or until the salmon flakes easily with a fork.",
        "Garnish with chopped fresh dill before serving."
      ]
    },
    {
      "id": 16,
      "title": "Chicken Noodle Soup",
      "ingredients": [
        "2 boneless, skinless chicken breasts",
        "6 cups chicken broth",
        "2 carrots, diced",
        "2 celery stalks, diced",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 cup egg noodles",
        "Fresh thyme",
        "Bay leaf",
        "Salt and pepper"
      ],
      "instructions": [
        "In a pot, bring chicken broth to a simmer.",
        "Add whole chicken breasts, diced carrots, diced celery, chopped onion, minced garlic, fresh thyme, and bay leaf.",
        "Simmer until chicken is cooked through and vegetables are tender.",
        "Remove chicken, shred it, and return it to the pot.",
        "Add egg noodles and cook until tender.",
        "Season with salt and pepper.",
        "Serve hot as a comforting and nourishing soup."
      ]
    },
    {
      "id": 17,
      "title": "Egg Fried Rice",
      "ingredients": [
        "3 cups cooked and cooled white rice",
        "2 eggs, beaten",
        "1 cup mixed vegetables (peas, carrots, corn, etc.)",
        "Soy sauce",
        "Sesame oil",
        "Green onions",
        "Cooking oil"
      ],
      "instructions": [
        "In a pan, heat cooking oil over medium heat.",
        "Add beaten eggs and scramble until just cooked.",
        "Push the eggs to one side of the pan and add mixed vegetables. Sauté until heated through.",
        "Add cooked rice to the pan and break up any clumps.",
        "Drizzle with soy sauce and sesame oil while stirring.",
        "Stir-fry until everything is well mixed and heated.",
        "Garnish with chopped green onions before serving."
      ]
    },
    {
      "id": 18,
      "title": "Homemade Beef Burgers",
      "ingredients": [
        "1 pound ground beef",
        "1/4 cup breadcrumbs",
        "1 egg",
        "1 onion, finely chopped",
        "Salt and pepper",
        "Hamburger buns",
        "Lettuce, tomato, onion slices",
        "Cheese slices (optional)"
      ],
      "instructions": [
        "In a bowl, combine ground beef, breadcrumbs, beaten egg, chopped onion, salt, and pepper.",
        "Mix until just combined; avoid overworking the meat.",
        "Divide the mixture into equal portions and shape into burger patties.",
        "Preheat a grill or skillet over medium-high heat.",
        "Cook the burgers for about 4-5 minutes on each side or until cooked to your preferred level of doneness.",
        "During the last minute of cooking, place cheese slices on top of the burgers to melt.",
        "Toast hamburger buns on the grill for a minute.",
        "Assemble the burgers with lettuce, tomato, onion slices, and any desired condiments."
      ]
    },
    {
      "id": 19,
      "title": "Caprese Salad",
      "ingredients": [
        "Fresh mozzarella cheese",
        "Tomatoes",
        "Fresh basil leaves",
        "Balsamic vinegar",
        "Olive oil",
        "Salt and pepper"
      ],
      "instructions": [
        "Slice fresh mozzarella cheese and tomatoes.",
        "Arrange alternating slices of cheese and tomatoes on a serving plate.",
        "Tuck fresh basil leaves between the cheese and tomatoes.",
        "Drizzle with balsamic vinegar and olive oil.",
        "Season with salt and pepper.",
        "Serve as a light and flavorful appetizer or side dish."
      ]
    },
    {
      "id": 20,
      "title": "Chocolate Mousse",
      "ingredients": [
        "6 ounces semi-sweet chocolate, chopped",
        "3 eggs, separated",
        "1/4 cup granulated sugar",
        "1 teaspoon vanilla extract",
        "Pinch of salt",
        "Whipped cream",
        "Chocolate shavings"
      ],
      "instructions": [
        "Melt the chopped chocolate in a heatproof bowl over simmering water. Let it cool slightly.",
        "In a separate bowl, whisk egg yolks, granulated sugar, vanilla extract, and a pinch of salt.",
        "Gradually whisk the melted chocolate into the egg yolk mixture.",
        "In another bowl, beat egg whites until stiff peaks form.",
        "Gently fold the beaten egg whites into the chocolate mixture.",
        "Divide the mousse into serving glasses and refrigerate for a few hours to set.",
        "Before serving, top with whipped cream and chocolate shavings."
      ]
    }
  ]
}
